Repository: autohotkey-docs-translation/v2-ja
Catalog: omegat/project_save.tmx
Source language: en
Languages: ja

source: EditGetCurrentCol - Syntax & Usage | AutoHotkey v2
ja: EditGetCurrentCol - 構文と使用法｜AutoHotkey v2

source: EditGetCurrentLine - Syntax & Usage | AutoHotkey v2
ja: EditGetCurrentLine - 構文と使用法｜AutoHotkey v2

source: EditGetLine - Syntax & Usage | AutoHotkey v2
ja: EditGetLine - 構文と使用法｜AutoHotkey v2

source: EditGetLineCount - Syntax & Usage | AutoHotkey v2
ja: EditGetLineCount - 構文と使用法｜AutoHotkey v2

source: EditGetSelectedText - Syntax & Usage | AutoHotkey v2
ja: EditGetSelectedText - 構文と使用法｜AutoHotkey v2

source: EditPaste - Syntax & Usage | AutoHotkey v2
ja: EditPaste - 構文と使用法｜AutoHotkey v2

source: Editor settings: Set the default editor for .ahk files.
ja: Editor settings：.ahkファイルのデフォルトエディタを設定します。

source: Editors with AutoHotkey Support
ja: AutoHotkeyをサポートするエディタ

source: Editors with AutoHotkey Support | AutoHotkey v2
ja: AutoHotkey対応エディター｜AutoHotkey v2

source: Effect
ja: 効果

source: Effectively, only when all operands are true, will the result be true.
ja: 事実上、すべてのオペランドが真のときのみ、結果は真となる。

source: Effectively, provided at least one operand is true, the result will be true.
ja: 事実上、少なくとも1つのオペランドが真であれば、結果は真になる。

source: Either CBS_DROPDOWN or CBS_SIMPLE
ja: CBS_DROPDOWNまたはCBS_SIMPLEのいずれか

source: Either control-specific or general options and styles.
ja: コントロールに特化したもの、一般的なオプションやスタイルのいずれかを選択します。

source: Either Length or Encoding may be specified directly after Source, but in those cases Encoding must be non-numeric.
ja: Sourceの後にLengthまたはEncodingを直接指定することもできるが、その場合Encodingは数値であってはならない。

source: Either Length or Encoding may be specified directly after Target, but in those cases Encoding must be non-numeric.
ja: Targetの後にLengthまたはEncodingを直接指定することもできるが、その場合Encodingは数値であってはならない。

source: Either a string of characters indicating the desired access mode followed by other options (with optional spaces or tabs in between); or a combination (sum) of numeric flags.
ja: 希望するアクセスモードを示す文字列の後に他のオプション（オプションで空白またはタブを挟む）が続くか、または数値フラグの組み合わせ（合計）です。

source: Either an integer value (a combination by addition or bitwise-OR) or a string of zero or more case-insensitive options separated by at least one space or tab.
ja: 整数値（加算またはビット単位のORによる組み合わせ）または、少なくとも1つのスペースまたはタブで区切られた、0個以上の大文字小文字を区別しないオプションの文字列。

source: Either coordinate can be negative to position the dialog partially or entirely off the desktop (or on a secondary monitor in a multi-monitor setup).
ja: どちらかの座標をマイナスにすると、ダイアログをデスクトップの一部または全部に配置することができます（マルチモニター環境ではセカンダリーモニターに配置）。

source: Either of these two lines registers a function object to be called after any previously registered functions:
ja: この2行のどちらかで、先に登録された関数の後に呼び出される関数オブジェクトを登録することができます：

source: Either parameter can be left blank to avoid changing it.
ja: どちらかのパラメータを変更しないように空白のままにすることもできる。

source: Either the keyboard hook is not installed (i.e. for a mouse hotkey), or there have been no other (unsuppressed) keydown or keyup events since the last Alt or Win keydown.
ja: キーボードフックがインストールされていないか（マウスのホットキー用）、最後のAltまたはWinキーダウン以降、他の（サポートされていない）キーダウンまたはキーアップイベントがないかのいずれかです。

source: Either the width or the height may be omitted to leave it unchanged (e.g. +MinSize640x or +MinSizex480).
ja: 幅または高さのどちらかを省略して変更しないことも可能です（例：+MinSize640x、+MinSizex480）。

source: Ejecting a removable drive is generally equivalent to using the "Eject" context menu option in Explorer, except that no warning is shown if files are in use.
ja: リムーバブルドライブの取り出しは、ファイルが使用中の場合に警告が表示されないことを除けば、エクスプローラーのコンテキストメニューオプション「取り出し」と概ね同じです。

source: Ejects (opens) the tray of the first CD/DVD drive.
ja: 1台目のCD/DVDドライブのトレイをイジェクト（開く）します。

source: Ejects all removable drives (except CD/DVD drives).
ja: すべてのリムーバブルドライブ（CD/DVDドライブを除く）をイジェクトします。

source: Ejects or retracts the tray of the specified CD/DVD drive, or ejects a removable drive.
ja: 指定したCD/DVDドライブのトレイを排出または収納したり、リムーバブルドライブを取り出したりすることができます。

source: Ejects the tray of the specified CD/DVD drive, or ejects a removable drive.
ja: 指定したCD/DVDドライブのトレイを排出したり、リムーバブルドライブを取り出したりします。

source: Element
ja: 要素

source: Elements (if any) to the right of the removed elements are shifted to the left to fill the vacated space.
ja: 取り除かれた要素の右側に要素があれば、その要素は左にシフトされ、空いたスペースを埋める。

source: Elements without a value are typically used for variadic calls or by variadic functions, but can be used for any purpose.
ja: 値のない要素は、通常、バリアドコールや バリアド関数によって使用されるが、どのような目的にも使用できる。

source: Else - Syntax & Usage | AutoHotkey v2
ja: Else - 構文と使用法｜AutoHotkey v2

source: Embedded Scripts
ja: 組み込みスクリプト

source: Emergencies consist of:
ja: 緊急事態とは：

source: Emits a tone from the PC speaker.
ja: パソコンのスピーカーから音を出します。

source: Empties the clipboard, copies the current selection into the clipboard and waits a maximum of 2 seconds until the clipboard contains data.
ja: クリップボードを空にし、現在の選択範囲をクリップボードにコピーし、クリップボードにデータが入るまで最大2秒間待機します。

source: Empties the clipboard.
ja: クリップボードを空にします。

source: Empties the recycle bin of the C drive.
ja: Cドライブのごみ箱を空にします。

source: Empties the recycle bin.
ja: ごみ箱を空にします。

source: Empty brackets (this.Property[]) always cause the __Item property of Property's value to be invoked, but a variadic call such as this.Property[args*] has this effect only if the number of parameters is non-zero.
ja: 空括弧（this.Property[]）は、常にPropertyの値の__Itemプロパティを呼び出しますが、this.Property[args*]のようなバリアディック呼び出しは、パラメータの数がゼロでない場合にのみ、この効果を持ちます。

source: Empty parentheses (except adjoining a function name); e.g. x ()
ja: 空白の括弧（関数名に隣接する場合を除きます）、例：x ()

source: Empty sub-command
ja: 空のサブコマンド

source: Enable (MyGui.Opt("+DPIScale")) and disable (MyGui.Opt("-DPIScale")) scaling on the fly, as needed.
ja: 必要に応じて、スケーリングをその場で有効化（MyGui.Opt("+DPIScale")）、無効化（MyGui.Opt("-DPIScale")）することができます。

source: Enables PCRE features that are incompatible with Perl.
ja: Perlと互換性のないPCREの機能を有効にする。

source: Enables a ListBox to recognize and expand tab characters when drawing its strings.
ja: リストボックスが文字列を描画するときにタブ文字を認識して展開できるようにする。

source: Enables a button to send BN_KILLFOCUS and BN_SETFOCUS notification codes to its parent window.
ja: BN_KILLFOCUSとBN_SETFOCUS通知コードを親ウィンドウに送信するボタンを有効にします。

source: Enables and disables line logging for specific lines and then displays the result.
ja: 特定の行のラインロギングを有効／無効にし、その結果を表示する。

source: Enables drag-and-drop reordering of columns in a list-view control.
ja: リストビューコントロールの列をドラッグ＆ドロップで並び替えられるようにする。

source: Enables every type of warning and shows each warning in a message box.
ja: あらゆる種類の警告を有効にし、各警告をメッセージボックスで表示します。

source: Enables exemption for subsequent hotkeys and hotstrings.
ja: 後に続くホットキーとホットストリングの例外を有効にします。

source: Enables flat scroll bars in the list view.
ja: リストビューでフラットスクロールバーを有効にする。

source: Enables full-row selection in the tree view.
ja: ツリービューで全行選択を有効にする。

source: Enables hot tracking of the mouse in a tree-view control.
ja: ツリービューコントロールでマウスのホットトラッキングを有効にする。

source: Enables hot-track selection in a list-view control.
ja: リストビューコントロールでホットトラック選択を有効にする。

source: Enables or disables a menu item.
ja: メニュー項目の有効／無効を設定します。

source: Enables or disables line logging or displays the script lines most recently executed.
ja: ログをとるのを有効または無効にしたり、最近実行されたスクリプトの行を表示したりします。

source: Enables or disables the specified control.
ja: 指定されたコントロールを有効または無効にします。

source: Enables or disables the specified window.
ja: 指定したウィンドウを有効または無効にします。

source: Enables or disables warnings for specific conditions which may indicate an error, such as a typo or missing "global" declaration.
ja: タイポや「グローバル」宣言の欠落など、エラーを示す可能性のある特定の条件に対する警告の有効・無効を設定します。

source: Enables recognition of additional newline markers.
ja: 追加の改行マーカーを認識できるようにする。

source: Enables the Blind mode, which gives the script more control by disabling a number of things that are normally done automatically to make things generally work as expected.
ja: ブラインドモードを有効にします。これは、一般的に期待通りに動作するように、通常自動的に行われる多くのことを無効にすることで、スクリプトをより制御できるようにするものです。

source: Enables the Raw mode, which causes the following characters to be interpreted literally:
ja: 以下の文字が文字通りに解釈されるRawモードを有効にします：

source: Enables the Raw mode, which causes the following characters to be interpreted literally: ^+!#{}.
ja: 以下の文字が文字通りに解釈されるRawモードを有効にします：^+!#{}。

source: Enables the Text mode, which sends a stream of characters rather than keystrokes.
ja: キーストロークではなく、文字のストリームを送信するテキストモードを有効にします。

source: Enables the auto-callout mode.
ja: 自動発信モードを有効にする。

source: Enables the forceful method of activating a window.
ja: ウィンドウをアクティブにする強制的な方法を有効にします。

source: Enables the hotkey if it is currently disabled.
ja: ホットキーが現在無効になっている場合は、有効にします。

source: Enables the hotstring.
ja: ホットストリングを有効にします。

source: Enables the maximize button in the title bar.
ja: タイトルバーの最大化ボタンを有効にします。

source: Enables the minimize button in the title bar.
ja: タイトルバーの最小化ボタンを有効にします。

source: Enables word-wrapping of the control's contents within its available width.
ja: コントロールの内容を使用可能な幅の範囲内でワードラッピングすることができるようにします。

source: Encapsulates a block of memory for use with advanced techniques such as DllCall, structures, StrPut and raw file I/O.
ja: DllCall、構造体、StrPut、生のファイルI/Oなどの高度な技術で使用するために、メモリブロックをカプセル化します。

source: Enclose in braces the name of the key followed by the number of times to repeat it.
ja: 中括弧で囲んで、キーの名前と、それを繰り返す回数を指定します。

source: Enclose in braces the name of the key followed by the word Down or Up.
ja: キーの名前の後にDownまたはUpという単語を中括弧で囲みます。

source: Enclose the program name in quotation marks.
ja: 番組名を引用符で囲んでください。

source: Enclosing a plain ASCII letter (a-z or A-Z) in braces forces it to be sent as the corresponding virtual keycode, even if the character does not exist on the current keyboard layout.
ja: ASCII文字（a-zまたはA-Z）を中括弧で囲むと、その文字が現在のキーボードレイアウトに存在しない場合でも、対応する仮想キーコードとして送信されます。

source: End of the file.
ja: ファイル終了。

source: EndKey returns an empty string if EndReason is not "EndKey".
ja: EndKey は、EndReasonが「EndKey」でない場合、空文字列を返す。

source: Ending Characters
ja: エンディングキャラクター

source: Ending characters initially consist of the following:
ja: エンディングキャラクターは、当初は以下のような構成になっています。

source: Ending characters initially consist of the following: -()[]{}':;"/\,.?!`n`s`t (note that `n is Enter, `s is Space, and `t is Tab).
ja: エンディングキャラクターは、当初は以下のような構成になっています：-()[]{}':;"/\,.?!`n`s`t（`nはEnter、`sはSpace、`tはTabです）。

source: Enjoy!
ja: 楽しもう！

source: Enlarges a variable's holding capacity or frees its memory.
ja: 変数の保持容量を拡大したり、メモリを解放したりします。

source: Enlarges the specified window to its maximum size.
ja: 指定したウィンドウを最大サイズに拡大します。

source: Ensure that at least one script is running that is using the keyboard hook.
ja: キーボードフックを使用するスクリプトが少なくとも1つ実行されていることを確認します。

source: Ensures that one or more statements are always executed after a Try statement finishes.
ja: Tryステートメントが終了した後、1つ以上のステートメントが常に実行されるようにします。

source: Ensures that the specified row is completely visible by scrolling the ListView, if necessary.
ja: 必要に応じて ListView をスクロールさせ、指定した行が完全に表示されるようにする。

source: Ensuring that the monitor function returns quickly reduces the risk that messages will be missed due to MaxThreads.
ja: モニター関数が素早く戻るようにすることで、MaxThreadsのためにメッセージが見逃されるリスクを減らすことができます。

source: Enter::Send "!o" ; Have an "Enter" keystroke open the selected reminder rather than snoozing it.
ja: Enter::Send "!o" ; Enterキーを押すと、選択したリマインダーをスヌーズするのではなく、開くようにします。

source: Enters a new search pattern into an existing Explorer/Search window.
ja: 既存のエクスプローラ/検索ウィンドウに新しい検索パターンを入力します。

source: Entries in large font are the most commonly used.
ja: 大きなフォントで書かれた項目は、最もよく使われる項目です。

source: EnumAddress := CallbackCreate(EnumWindowsProc, "Fast") ; Fast-mode is okay because it will be called only from this thread.
ja: EnumAddress := CallbackCreate(EnumWindowsProc, "Fast") ; Fast-modeはこのスレッドからしか呼ばれないので大丈夫です。

source: Enumerates an object's own properties.
ja: オブジェクト自身のプロパティを列挙する。

source: Enumerates array elements.
ja: 配列の要素を列挙します。

source: Enumerates key-value pairs.
ja: キーとバリューのペアを列挙します。

source: Enumerates the GUI's controls.
ja: GUI のコントロールを列挙します。

source: Enumerating items:
ja: 項目を列挙する：

source: Enumeration
ja: 列挙

source: Enumeration of ComObjArray is now consistent with Array; i.e. for value in arr or for index, value in arr rather than for value, vartype in arr.
ja: ComObjArrayの列挙がArrayと一致するようになりました。つまり、for value in arrやfor index, value in arrではなく、for value, vartype in arrです。。

source: Enumerator Object
ja: Enumeratorオブジェクト

source: Enumerator Object - Definition & Usage | AutoHotkey v2
ja: Enumeratorオブジェクト - 定義と使用法｜AutoHotkey v2

source: Enumerators exist primarily to support For-loops, and are not usually called directly.
ja: Enumeratorオブジェクトは主にForループをサポートするために存在し、通常は直接呼び出されることはない。

source: EnvGet - Syntax & Usage | AutoHotkey v2
ja: EnvGet - 構文と使用法｜AutoHotkey v2

source: EnvSet - Syntax & Usage | AutoHotkey v2
ja: EnvSet - 構文と使用法｜AutoHotkey v2

source: EnvUpdate (it is of very limited usefulness and can be replaced with a simple SendMessage)
ja: EnvUpdate（有用性は非常に低く、単純なSendMessageに置き換えることができます）

source: EnvUpdate was removed, but can be replaced with a simple call to SendMessage as follows:
ja: EnvUpdateは削除されましたが、以下のようにSendMessageの単純な呼び出しに置き換えることができます：

source: Environment
ja: 環境

source: Environment Variables
ja: 環境変数

source: Environment variables are maintained by the operating system.
ja: 環境変数は、オペレーティングシステムによって管理されます。

source: Equal signs (=) with a symbol in front of it such as := += -= .= etc. are called assignment operators and always require an expression.
ja: := += -= .= などのように、記号を前に置いた等号（=）は代入演算子と呼ばれ、常に式を必要とする。

source: Equals after a comma is no longer assignment:
ja: カンマの後のEqualsは、割り当てられなくなりました：

source: Equals after a comma is no longer assignment: y=z in x:=y, y=z is an ineffectual comparison instead of an assignment.
ja: カンマの後のEqualsは、割り当てられなくなりました：x:=y, y=zのy=zは、代入ではなく非効率的な比較です。

source: Equivalent to Push.
ja: プッシュに相当します。

source: Equivalent to Set.
ja: セットに相当します。

source: Equivalent to WStr in AutoHotkey v2.
ja: AutoHotkey v2 のWStrに相当します。

source: Equivalent to the previous example.
ja: 前例に準ずる。

source: Equivalent to the corresponding predefined method, but cannot be overridden.
ja: 対応する定義済みメソッドと同等ですが、オーバーライドすることはできません。

source: Error Class
ja: エラークラス

source: Error Handling
ja: エラー処理

source: Error Message
ja: エラーメッセージ

source: Error Object
ja: Errorオブジェクト

source: Error Object | AutoHotkey v2
ja: Errorオブジェクト｜AutoHotkey v2

source: Error Types
ja: エラータイプ

source: Error detection in v2.0 is generally more robust, and as there have been numerous changes to usage beyond just error detection and handling, the differences in error detection between v1.0 and v1.1 are not listed here.
ja: v2.0でのエラー検出は一般に堅牢であり、また、エラー検出や処理にとどまらず、使用方法にも多くの変更があるため、v1.0とv1.1とのエラー検出の違いはここでは記載しないことにします。

source: Error messages were changed to be constant (and shorter), with the key or hotkey name in Exception.Extra, and the class of the exception indicating the reason for failure.
ja: エラーメッセージは、Exception.Extraにキーまたはホットキーの名前を、例外のクラスで失敗の理由を示す、一定の（より短い）メッセージに変更されました。

source: Error objects are thrown by built-in code when a runtime error occurs, and may also be thrown explicitly by the script.
ja: Errorオブジェクトは、実行時エラーが発生したときに組み込みコードによってスローされ、またスクリプトによって明示的にスローされることもある。

source: Error objects have a Stack property containing a stack trace.
ja: エラーオブジェクトは、スタックトレースを含むStackプロパティを持ちます。

source: Error objects thrown by built-in code when an error occurs.
ja: Errorが発生したときに組み込みコードから投げられるエラーオブジェクト。

source: Error values (as defined by the FAILED macro) are never returned; instead, an OSError is thrown.
ja: エラー値（FAILED マクロで定義される）は決して返されず、代わりにOSErrorが投げられる。

source: Error-Handling
ja: エラーハンドリング

source: Error-handling
ja: エラーハンドリング

source: Error:
ja: エラー：

source: ErrorLevel
ja: エラーレベル

source: ErrorLevel has been removed.
ja: ErrorLevelは削除されました。

source: ErrorLevel is not set.
ja: ErrorLevelが設定されていない。

source: ErrorLevel was removed.
ja: ErrorLevelを削除しました。

source: Errors
ja: エラー

source: Errors are also thrown using the base Error class.
ja: また、エラーは、ベースとなるErrorクラスを使用してスローされます。

source: Errors are written to stderr instead of stdout.
ja: エラーは標準出力ではなく、標準エラーに書き込まれます。

source: Errors due to incorrect use of DllCall, RegExMatch and RegExReplace were fairly common due to their complexity, and (like many errors) are easier to detect and debug if an error message is shown immediately.
ja: DllCall、RegExMatch、RegExReplaceの誤った使用によるエラーは、その複雑さゆえにかなり多く、（多くのエラーと同様に）エラーメッセージがすぐに表示されれば、検出やデバッグが容易になります。

source: Escape (or Esc)
ja: Escape（またはEsc）

source: Escape Sequences
ja: エスケープシーケンス

source: Escape Sequences - Definition & Usage | AutoHotkey v2
ja: エスケープシーケンス - 定義と使用法｜AutoHotkey v2

source: Escape sequences are used to indicate that specific characters should be interpreted differently than they normally would.
ja: エスケープ・シーケンスは、特定の文字が通常とは異なって解釈されることを示すために使用される。

source: Escape sequences in the form \xhh are also supported, in which hh is the hex code of any ANSI character between 00 and FF.
ja: \xhh 形式のエスケープシーケンスもサポートしており、 hh は00からFFまでのANSI文字の16進コードである。

source: Escaping a comma no longer has any meaning.
ja: コンマのエスケープには、もはや何の意味もありません。

source: Escaping can be avoided by using \Q...\E.
ja: エスケープを回避するには、\Q...\Eを使用します。

source: Even a variable which is only assigned a value once can be useful.
ja: 一度しか値が代入されない変数でも、役に立つことがあります。

source: Even faster performance can be achieved by looking up the function's address beforehand.
ja: ; 関数のアドレスをあらかじめ調べておくことで、さらに高速なパフォーマンスを実現することができます。

source: Even if a change is successfully applied, the control might choose to ignore it.
ja: 変更が正常に適用されたとしても、コントロールはそれを無視することを選択するかもしれません。

source: Even if the name of each property was known in advance, it would not be logical to define each property individually in the proxy class since every property does the same thing (send a network request).
ja: 各プロパティの名前が事前に分かっていたとしても、どのプロパティも同じこと（ネットワーク・リクエストを送信する）を行うので、プロキシ・クラスで各プロパティを個別に定義するのは論理的ではない。

source: Even if you use KeyTweak to make the registry entries for you, KeyTweak does not need to stay running all the time (unlike AutoHotkey).
ja: KeyTweakを使ってレジストリエントリを作成しても、（AutoHotkeyと違って）KeyTweakは常に起動している必要はありません。

source: Even then, any changes to the left/right modifier keys (e.g. RControl) can be detected only via their neutral counterparts (e.g. Control).
ja: その場合でも、左右の修飾キー（例：RControl）の変更は、中立の対応するキー（例：Control）を介してのみ検出することができます。

source: Even though the two examples above are not auto-replace hotstrings, the abbreviation you type is erased by default.
ja: 上の2つの例は自動置換ホットストリングでないにもかかわらず、入力した略語はデフォルトで消去されます。

source: Even when it is successfully turned off, it might not get turned back on after the keys are sent.
ja: 正常にOFFになった場合でも、キー送信後に再度ONにならない場合があります。

source: Even when the path itself is not limited to 259 characters, each component (file or directory name) cannot exceed the hard limit imposed by the file system (usually 255 characters).
ja: パス自体が259文字に制限されていない場合でも、各コンポーネント（ファイル名またはディレクトリ名）は、ファイルシステムによって課されるハードリミット（通常は255文字）を超えることはできません。

source: Even while waiting, new threads can be launched via hotkey, custom menu item, or timer.
ja: 待機中であっても、ホットキー、カスタムメニュー項目、またはタイマーによって新しいスレッドを起動することができる。

source: Event
ja: イベント

source: Event Sink
ja: イベント同期

source: Event handlers (such as a function which is called automatically when the user clicks or changes a control) cannot be set within the control's Options.
ja: イベントハンドラ（ユーザーがコントロールをクリックまたは変更したときに自動的に呼び出される関数など）は、コントロールのオプションで設定することはできません。

source: Events
ja: イベント

source: Events which have a send level lower than this value are ignored.
ja: この値より低い送信レベルを持つイベントは無視されます。

source: Every newly launched thread (such as a hotkey, custom menu item, or timed subroutine) starts off fresh with the default setting for this function.
ja: 新しく起動するスレッド（ホットキー、カスタムメニュー項目、時間指定サブルーチンなど）はすべて、この機能のデフォルト設定で新しくスタートします。

source: Every newly launched hotkey or hotstring thread starts off with a send level equal to the input level of the hotkey or hotstring.
ja: 新しく起動したホットキーやホットストリングのスレッドは、ホットキーやホットストリングの入力レベルに等しい送信レベルで始まります。

source: Every other newly launched thread (such as a custom menu item or timed subroutine) starts off fresh with the default setting, which is typically 0 but may be changed by using this function during script startup.
ja: その他の新しく起動するスレッド（カスタムメニュー項目や 時間指定サブルーチンなど）は、通常0ですが、スクリプト起動時にこの関数を使用して変更することができるデフォルト設定で新たに開始されます。

source: Every single other extension.
ja: 他のすべてのエクステンション。

source: Every use of Catch must belong to (be associated with) a Try statement above it.
ja: Catchの使用はすべて、その上のTry文に属する（関連付けられる）必要があります。

source: Every use of Finally must belong to (be associated with) a Try statement above it (after any optional Catch and/or Else).
ja: Finallyの使用はすべて、その上のTry文（任意のCatchや Elseの後）に属する（関連付けられる）ものでなければなりません。

source: Every use of catch must belong to (be associated with) a try statement above it.
ja: catchの使用はすべて、その上のtry文に属する（関連付けられる）必要があります。

source: Every use of finally must belong to (be associated with) a try statement above it (after any optional catch and/or else).
ja: finallyの使用はすべて、その上のtry文（任意のcatchや elseの後）に属する（関連付けられる）ものでなければなりません。

source: Every use of an Else must belong to (be associated with) an If statement, Catch, For, Loop or While statement above it.
ja: Elseの使用は、その上にあるIf文、Catch、For、Loop、While文に属する（関連付けられる）ものでなければなりません。

source: Everyone is permitted to copy and distribute verbatim copies
ja: 誰もが逐語的なコピーをし、配布することが許可されているが、

source: ExStyle
ja: 拡張スタイル

source: Example
ja: 例

source: Example client which justs lists the variables of all running scripts.
ja: 実行中のスクリプトの変数を一覧表示するだけのクライアント例。

source: Example entry:
ja: 記入例：

source: Example string:
ja: 文字列の例：

source: Example string: ZRUVPD
ja: 文字列の例：ZRUVPD

source: Example usage:
ja: 使用例：

source: Example usage: Base**Exponent.
ja: 使用例：基数**指数。

source: Example usage: Value1 << Value2.
ja: 使用例：Value1 << Value2。

source: Example usage: Value1 >> Value2.
ja: 使用例：Value1 >> Value2。

source: Example usage: Value1 >>> Value2.
ja: 使用例：Value1 >>> Value2。

source: Example use might be to implement units of measurement, literal version numbers or ranges.
ja: 使用例としては、測定単位、リテラルバージョン番号、範囲などを実装することが考えられます。

source: Example values:
ja: 例値：

source: Example values: "Silver", "FFFFAA", 0xFFFFAA, "Default".
ja: 例値："Silver"、"FFFFAA"、0xFFFFAA、"Default"。

source: Example values: "Silver", "FFFFAA", 0xFFFFAA, "Default", "".
ja: 例値："Silver"、"FFFFAA"、0xFFFFAA、"Default"、""。

source: Example values: cRed, cFFFFAA, cDefault.
ja: 例値：cRed、cFFFFAA、cDefault。

source: Example:
ja: 例：

source: Examples
ja: 例

source: Examples include MButton (mouse hook) and LWin & Space (keyboard hook with explicit prefix rather than modifiers "$#").
ja: 例えば、MButton（マウスフック）、LWin & Space（キーボードフック、修飾語"$#"ではなく明示的な接頭語を持つ）などがあります。

source: Examples include MButton (mouse hook) and LWin & Space (keyboard hook with explicit prefix rather than modifiers $#).
ja: 例えば、MButton（マウスフック）、LWin & Space（キーボードフック、修飾語$#ではなく明示的な接頭語を持つ）などがあります。

source: Examples include Microsoft Outlook and Outlook Express, which use disguised toolbars for their menu bars.
ja: 例えば、Microsoft OutlookやOutlook Expressは、メニューバーに偽装されたツールバーを使用しています。

source: Examples of their many uses include taking some action when the user becomes idle (as reflected by A_TimeIdle) or closing unwanted windows the moment they appear.
ja: 例えば、ユーザーがアイドル状態になったときに何らかのアクションを起こす（A_TimeIdleで反映される）、不要なウィンドウが表示されたらすぐに閉じるなど、さまざまな使い方があります。

source: Examples:
ja: 例：

source: Examples: ^!c, ^Numpad1, +Home.
ja: 例：^!c、^Numpad1、+Home。

source: Examples: ^!C, ^Home, +^NumpadHome.
ja: 例：^!C、^Home、+^NumpadHome。

source: Examples: cRed, cFF2211, c0xFF2211, cDefault.
ja: 例：cRed、cFF2211、c0xFF2211、cDefault。

source: Examples: BackgroundSilver, BackgroundFFDD99.
ja: 例：BackgroundSilver、BackgroundFFDD99。

source: Examples: *TransBlack, *TransFFFFAA, *Trans0xFFFFAA.
ja: 例：*TransBlack、*TransFFFFAA、*Trans0xFFFFAA。

source: Examples: B, 5, LWin, RControl, Alt, Enter, Escape, LButton, MButton, Joy1.
ja: 例：B、5、LWin、RControl、Alt、Enter、Escape、LButton、MButton、Joy1。

source: Examples: B, 5, LWin, RControl, Alt, Enter, Escape.
ja: 例：B、5、LWin、RControl、Alt、Enter、Escape。
